jack77er/openUTRUSTA/Packages/.cache/Keil.STM32L4xx_DFP.1.0.0.pdsc
          <variant Dvariant="STM32L486ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32L471">
      <description>STMicroelectronics STM32L471 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L471*"/>
    </condition>
    <condition id="STM32L475">
      <description>STMicroelectronics STM32L475 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L475*"/>
    </condition>
    <condition id="STM32L476">
      <description>STMicroelectronics STM32L476 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L476*"/>
    </condition>
     <condition id="STM32L485">
      <description>STMicroelectronics STM32L485 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L485*"/>
    </condition>
     <condition id="STM32L486">
      <description>STMicroelectronics STM32L486 Devices</description>
      <accept  Dvendor="STMicroelectronics:13" Dname="STM32L486*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32L471 CMSIS">
      <description>STMicroelectronics STM32L471 Devices and CMSIS-Core</description>
      <require condition="STM32L471"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L475 CMSIS">
      <description>STMicroelectronics STM32L475 Devices and CMSIS-Core</description>
      <require condition="STM32L475"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L476 CMSIS">
      <description>STMicroelectronics STM32L476 Devices and CMSIS-Core</description>
      <require condition="STM32L476"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L485 CMSIS">
      <description>STMicroelectronics STM32L485 Devices and CMSIS-Core</description>
      <require condition="STM32L485"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L486 CMSIS">
      <description>STMicroelectronics STM32L486 Devices and CMSIS-Core</description>
      <require condition="STM32L486"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
  <!-- Startup startup_stm32l471 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32L471 CMSIS">
      <description>System Startup for STMicroelectronics STM32L471 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32l471xx.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32l4xx.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l475 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32L475 CMSIS">
      <description>System Startup for STMicroelectronics STM32L475 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32l475xx.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32l4xx.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l476 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32L476 CMSIS">
      <description>System Startup for STMicroelectronics STM32L476 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32l476xx.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32l4xx.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l485 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32L485 CMSIS">
      <description>System Startup for STMicroelectronics STM32L485 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32l485xx.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32l4xx.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup startup_stm32l486 -->
    <component  Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32L486 CMSIS">
      <description>System Startup for STMicroelectronics STM32L486 Devices</description>
      <files>
        <file category="include"   name="Device\Include\"/>
        <file category="sourceAsm" name="Device\Source\ARM\startup_stm32l486xx.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="sourceC"   name="Device\Source\system_stm32l4xx.c"        attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- STM32L476G-EVAL Board Support -->
    <bundle Cbundle="STM32L476G-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32L476G-EVAL Board</description>
      <doc></doc>
      <component Cgroup="LED" condition="STM32L476 CMSIS">
      <description>LED driver for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="source" name="Boards\ST\STM32L476G-EVAL\Common\LED_STM32L476G-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" condition="STM32L476 CMSIS">
      <description>Button driver for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
        <file category="sourceC" name="Boards\ST\STM32L476G-EVAL\Common\Buttons_STM32L476G-EVAL.c"/>
        </files>
      </component>
    </bundle>
  </components>

